{
    "match":{
        "happy":{
                "happy_first_pair": [
                "Ottimo! Hai trovato la prima coppia!"
            ],

            "happy_beg_mid": [
                "Sembra che tu ti stia divertendo. Ottimo lavoro!",
                "Sei felice di aver trovato la prima coppia, vero? Stai andando bene!"
            ],

            "happy_end": [
                "Ti stai divertendo vero? Continua così, abbiamo quasi finito",
                "Sei felice di essere arrivato quasi alla fine? Dai manca poco!"
            ],

            "happy_last_pair": [
                "Congratulazioni, hai trovato l'ultima coppia! Mi sembra che questa esperienza ti abbia divertito!",
                "Noto con piacere che sei felice di aver giocato, vale lo stesso per me!"
            ]
        },

        "neutral":{
            "neutral_first_pair":[
                "Fantastico! Hai trovato la prima coppia!",
                "Hai trovato la prima coppia, stai andando benissimo"
            ],

            "neutral": [
                "Fantastico! Hai trovato un'altra coppia!",
                "Hai trovato un'altra coppia, stai andando benissimo",
                "Hey complimenti, un'altro passo verso la fine. Continua così",
                "Ottimo lavoro!"
            ],

            "neutral_end": [
                "Dai, ci siamo quasi!",
                "Complimenti, siamo quasi arrivati alla fine. Ottimo lavoro!"
            ],

            "neutral_last_pair": [
                "Congratulazioni, hai trovato l'ultima coppia! Spero che questa esperienza ti abbia fatto piacere!",
                "Ottimo lavoro, hai trovato l'ultima coppia!"
            ]
        },

        "surprise": [
            "Wow, che fortuna, vero?",
            "Non ti aspettavi di trovare la coppia? Che fortuna!"
        ]
    },

    "unmatch": {
        "neutral_begin": [
            "Non preoccuparti, è comune non ricordare le locazioni all'inizio.",
            "Capita di sbagliare, soprattutto all'inizio. Prenditi il tuo tempo!",
            "Non fa niente, stai andando bene.",
            "Non preoccuparti, quando sarai in difficoltà ti aiutero io!",
            "Siamo solo agli inizi, è naturale non ricordare le varie locazioni",
            "È comprensibile fare errori all'inizio. Prenditi il tuo tempo!",
            "Non c'è problema, capita di non ricorcare le locazioni agli inizi."
        ],

        "neutral_mid_end": [
            "Non importa se non ricordi le locazioni, ti aiuterò io!",
            "Non ricordi le locazioni? Non preoccuparti, è solo un gioco",
            "Non preoccuparti, ti aiuterò io!",
            "Ehy, capita di sbagliare.",
            "Non preoccuparti, stai andando bene"
        ],

        "sad": [
            "Sei triste perchè non hai trovato la coppia? Non preoccuparti, puoi farcela!",
            "Non preoccuparti, può capitare",
            "Può essere difficile ricordare tutte le locazioni, non preoccuparti!",
            "Può capitare di sbagliare. Continua a giocare."
        ],

        "angry": [
            "Non arrabbiarti, non fa niente se non hai trovato la coppia.",
            "Non arrabbiarti, può capitare.",
            "Coraggio, non arrabbiarti, l'importante è arrivare alla fine.",
            "Può essere difficile ricordare tutte le locazioni, non preoccuparti!"
        ],

        "other": [
            "Non importa se non ricordi le locazioni, ti aiuterò io!",
            "Non ricordi le locazioni? Non preoccuparti, è solo un gioco",
            "Non preoccuparti, ti aiuterò io!",
            "Ehy, capita di sbagliare.",
            "Non preoccuparti, stai andando bene"
        ]
    }
}